[
    {
        "type": "Design Considerations",
        "pillars": [
            "scenario/wvd"
        ],
        "lens": "scenario",
        "category": "WVD",
        "subCategory": "FSLogix",
        "title": "[FSLogix](https://docs.microsoft.com/en-us/azure/architecture/example-scenario/wvd/windows-virtual-desktop-fslogix) technology allows for users profiles to be stored in a central location and accessed by WVD Session Hosts, side loading the disks in a seamless manner",
        "context": "If using a solution where your users can sign into different Windows Virtual Desktop Session Hosts (Multi-session for example), [FSLogix](https://docs.microsoft.com/en-us/azure/architecture/example-scenario/wvd/windows-virtual-desktop-fslogix) should be used to centralize users' profiles.",
        "recommendation": "Review your central profile store architecture and incorporate FSLogix if you are using multi-session",
        "children": [
            {
                "title": "The chosen storage service for FSLogix",
                "context": "Azure Files ([Azure AD Domain Services](https://docs.microsoft.com/en-us/azure/virtual-desktop/create-profile-container-adds) or [Active Directory Domain Servces](https://docs.microsoft.com/en-us/azure/virtual-desktop/create-file-share), [Azure NetApp Files](https://docs.microsoft.com/en-us/azure/virtual-desktop/create-fslogix-profile-container), [VM-based file share](https://docs.microsoft.com/en-us/azure/virtual-desktop/create-host-pools-user-profile)"
            },
            {
                "title": "[FSLogix Cloud Cache](https://docs.microsoft.com/en-us/fslogix/cloud-cache-resiliency-availability-cncpt) for Business Continuity & Disaster Recovery",
                "context": "FSLogix Cloud Cache is used for best practice failover and quick recovery scenarios"
            },
            {
                "title": "Backup solution for the chosen storage service that FSLogix will be using",
                "context": "It is just as vital to implement a backup solution next to your disaster recovery solution"
            },
            {
                "title": "Design your storage to reside as close as possible to your session hosts",
                "context": "This increases performance and latency for a better end user experience"
            },
            {
                " title": "Exclude user profile VHD(x) from AV and malware scans" ,
                "context": "All files inside the VHD would be scanned on demand"
            }

        ]
    },
    {
        "type": "Design Considerations",
        "pillars":[
            "scenario/wvd"
        ],
        "lens":"scenario",
        "category":"WVD",
        "subCategory": "Networking & Connectivity",
        "title": "Networking is a core component of Windows Virtual Desktop and should be included in your solution design",
        "recommendation": "WVD Session Hosts have to exist on a Virtual Network so Virtual Network/Subnet configuration will have to be considered. We have [example scenario architecture](https://docs.microsoft.com/en-us/azure/architecture/example-scenario/wvd/windows-virtual-desktop#architecture) which can help visualize network connectivity.",
        "children":[
            {
                "title": "Active Directory Domain Services line of site",
                "context": "For WVD Session Hosts to join onto your Active Directory domain, the Virtual Network they reside on should be able to resolve your Active Directory domain name"
            },
            {
                "title": "Application workload line of sight from your WVD Architecture",
                "context": "Some application workloads may not be running in Azure which means that WVD will require access to third party datacenters (ExpressRoute, site-to-site VPN)"
            },
            {
                "title": "Designing your solution architecture for scale",
                "context": "By allowing your WVD Session Hosts to have a dedicated subnet inside a Virtual Network, the outcome is the solution has the ability to scale to meet demand should it need to"
            }
        ]
    },
    {
        "type": "Design Considerations",
        "pillars":[
            "scenario/wvd"
        ],
        "lens":"scenario",
        "category":"WVD",
        "subCategory": "Identity & Access Control",
        "title": "Windows Virtual Desktop requires that there is a hybrid identity solution implemented",
        "recommendation": "The hybrid identity solution in this instance would be Azure AD Connect",
        "children":[
            {
                "title": "Set up  [Azure AD Connect](https://docs.microsoft.com/en-us/azure/active-directory/hybrid/whatis-azure-ad-connect).",
                "context": "This is a prerequisite for Windows Virtual Desktop. This is required to translate the user signing into the WVD Management plane via Azure AD to the user in the Active Directory forest"
            },
            {
                "title": " WVD Users must be sourced from the same Active Directory Domain Service (ADDS) that is synchronising to Azure AD. WVD Does not support B2B or Microsoft Accounts",
                "context": "Synchronize all identities to a single Azure AD using Azure AD Connect"
            },
            {
                "title": "The account used for domain join during the session host building cannot have multi-factor authentication or other interactive prompts",
                "context": "During the session host building phase/automation the account used to work on those hosts cannot have multi-factor authentication"
            },
            {
                "title": "Specifying the Organizational Unit (OU) that WVD Session Hosts will reside in",
                "context": "Segregate the WVD Session Host Virtual Machines (VMs) into Active Directory OUs (Organizational Units) for each host pool to manage policies and orphaned objects"
            },
            {
                "title": "Follow the principle of least privilege",
                "context": "For WVD Users, the Desktop Virtualization User built-in RBAC Role to Security Groups to grant access to WVD App Groups"
            },
            {
                "title": "Leverage Azure AD Conditional Access policies",
                "context": "Create policies for WVD. For example, multi-factory authentication can be enforced on conditions such as risky sign-ins increasing an organizations security posture"
            }
        ]
    },
    {
        "type":"Design Considerations",
        "pillars":[
            "scenario/wvd"
        ],
        "lens":"scenario",
        "category":"WVD",
        "subCategory": "Management & Monitoring",
        "title": "Managing and monitoring any Azure service is a core component from an operations standpoint which is why this is included in Design Considerations",
        "recommendation": "Azure Monitor, Azure Log Analytics and Azure Management tools generally available",
        "children":[
            {
                "title": "Windows Virtual Desktop service logs should be integrated into Azure Monitor",
                "context": "Azure Monitor allows for a single location around log and monitoring data in Azure"
            },
            {
                "title": "(Storage) Storage requirements should be optimized for performance in the Windows Virtual Desktop service",
                "context": "Storage sizing for Azure Files and Azure NetApp Files need to align with IOPS Requirements"
            },
            {
                "title": "(Storage) Size of the volumes should reflect the performance needed",
                "context": "Consideration of the size of the volume where user profiles will be stored on a per user profile size basis"
            },
            {
                "title": "(Storage - Azure Files) SKU of the Azure Files Storage Account",
                "context": "Light users - Standard File Shares, Medium users - Standard/Premium File Shares, Heavy users - Premium File Shares, Power users - Premium File Shares"
            }
        ]
    }
]