[
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams",
        "subCategory": "Requirements",
        "title": "Requirements",
        "context": "High-level requirements for a specific Microsoft Teams App solution like availability, latency, expected no. of users etc.",
        "recommendation": "",
        "children": [
            {
                "title": "How many users are expected to use the solution?",
                "context": "The number of expected hourly, daily, monthly users is a good indicator for later requirements in regards to scalability and others.",
                "id": "teams_high_level_requirements_1"
            },
            {
                "title": "Is the solution accessed from users in a specific geographic region?",
                "context": "Solutions with users from various geographical regions have other requirements in regards to latency and availability.",
                "recommendation": "Solutions with users from different geographical regions should leverage multi-region deployments and global load balancers like Azure Front Door or Traffic Manager to distribute load across different regional deployments for latency and failover purposes.",
                "id": "teams_high_level_requirements_2"
            },
            {
                "title": "What is the expected SLA or availability for the solution and its components?",
                "context": "Different Teams applications can have varying requirements in terms of availability and contractual SLAs. Internal-only chatbot may accept more outage time than a Tabs application used as the only surface for a business system. Availability of dependent services (such as QnA knowledgbases) need to be considered as well.",
                "id": "teams_high_level_requirements_3"
            }
        ],
        "id": "teams_high_level_requirements"
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Architecture",
        "title": "Solution Architecture & Overview",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Is the solution backend hosted on a cloud platform like Azure?",
                "context": "Cloud platforms like Microsoft Azure offer certain capabilities like auto scaling and data center regions across the globe that might not be available on-premises."
            },
            {
                "title": "Does the solution depend on specific Azure PaaS services?",
                "context": "Not all PaaS services are available in all Azure data center regions, do not have the same scale capabilities, SLAs and options."
            },
            {
                "title": "Does the solution have dependencies to any on-premises systems?",
                "context": "Solutions with dependencies to on-premises systems might have specific requirements in regards to connectivity via e.g. VPN or Express Route."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Design",
        "title": "Is the current solution able to scale?",
        "context": "Scalability is a key aspect to fulfill increasing usage while maintaining a consistent user experience.",
        "recommendation": "Teams Apps should be designed from the beginning to be able to scale in and out easily based on changing demand.",
        "children": [
            {
                "title": "Is the solution separated into separate components that can scale individually?",
                "context": "Separate components of an application might have different requirements in regards to scalability, state and lifecycle.",
                "recommendation": "Separate larger solutions into smaller, microservice-like components that can scale individually."
            }
        ],
        "id": ""
    },
    {
        "type": "Design Considerations",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Design",
        "title": "Security",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "If the solution requires authentication, integrate Microsoft single sign-on (SSO) for a seamless sign-in experience."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Design",
        "title": "How is the solution and its components monitored?",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Are critical system flows within the solution monitored?"
            },
            {
                "title": "Are response times monitored?",
                "context": "If a response to an action takes more than three seconds, you must provide a loading message or warning.",
                "recommendation": "Make sure that the app displays a loading indicator or some form of warning when something is taking longer than expected to respond."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Processes",
        "title": "How are changes and features rolled out?",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Is there a separation between dev/test and prod?"
            },
            {
                "title": "Are new releases versioned and tested before they're rolled out to production?"
            },
            {
                "title": "Where are changes to the Teams Tab app tested?",
                "context": "Microsoft Teams apps can be debugged Purely local, Locally hosted in Teams or Cloud-hosted in Teams. See [Choosing a setup to test and debug your Microsoft Teams app](https://docs.microsoft.com/microsoftteams/platform/concepts/build-and-test/debug) for more."
            },
            {
                "title": "Is it possible to test changes in a production-like environment first?"
            }
        ],
        "id": ""
    },
    {
      "type": "Design Recommendations",
      "pillars": [
          "scenario/teams"
      ],
      "lens": "scenario",
      "category": "Security & Compliance",
      "subCategory": "Network Security",
      "title": "Protect QnA Maker with network isolation.",
      "context": "Azure Cognitive Services provides a layered security model. This model enables you to [secure your Cognitive Services accounts](https://docs.microsoft.com/azure/cognitive-services/cognitive-services-virtual-networks?tabs=portal) to a specific subset of networks. When network rules are configured, only applications requesting data over the specified set of networks can access the account. On the App Service side, you can use the `CognitiveServicesManagement` service tag to allow the Authoring APIs to invoke App Service and update Azure Search accordingly. Make sure you also allow other entry points like Bot service, QnA Maker portal (may be your corporate network) etc. for prediction `GenerateAnswer` API access. Alternatively, the App Service Environment (ASE) can be used to host QnA Maker App Service. See [Recommended settings for network isolation](https://docs.microsoft.com/azure/cognitive-services/qnamaker/how-to/set-up-qnamaker-service-azure?tabs=v1#recommended-settings-for-network-isolation) for more."
    }
]