[
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Requirements",
        "title": "Requirements",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "How many users are expected to use the solution?",
                "context": "The number of expected hourly, daily, monthly users is a good indicator for later requirements in regards to scalability and others."
            },
            {
                "title": "Is the solution accessed from users in a specific geographic region?",
                "context": "Solutions with users from various geographical regions have other requirements in regards to latency and availability."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Architecture",
        "title": "Solution Architecture & Overview",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Is the solution backend hosted on a cloud platform like Azure?"
            },
            {
                "title": "Does the solution have dependencies to any on-premises systems?",
                "context": "Solutions with dependencies to on-premises systems might have specific requirements in regards to connectivity via e.g. VPN or Express Route."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Design",
        "title": "Is the current solution able to scale?",
        "context": "Scalability is a key aspect to fulfill increasing usage while maintaining a consistent user experience.",
        "recommendation": "Teams Apps should be designed from the beginning to be able to scale in and out easily based on changing demand.",
        "children": [
            {
                "title": "Is the solution separated into separate components that can scale individually?",
                "context": "Separate components of an application might have different requirements in regards to scalability, state and lifecycle.",
                "recommendation": "Separate larger solutions into smaller, microservice-like components that can scale individually."
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Design",
        "title": "How is the solution and its components monitored?",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Are critical system flows within the solution monitored?"
            }
        ],
        "id": ""
    },
    {
        "type": "Questions",
        "pillars": [
            "scenario/teams"
        ],
        "lens": "scenario",
        "category": "Teams Tab Apps",
        "subCategory": "Processes",
        "title": "How are changes and features rolled out?",
        "context": "",
        "recommendation": "",
        "children": [
            {
                "title": "Is it possible to test changes in a production-like environment first?"
            }
        ],
        "id": ""
    }    
]