[
    {
        "type": "Design Considerations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Storage account names must be between 3 and 24 characters in length and may contain numbers and lowercase letters only."
    },
    {
        "type": "Design Considerations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Storage account names must be unique within Azure. No two storage accounts can have the same name."
    },
    {
        "type": "Design Considerations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "The current [SLA for Storage Accounts](https://azure.microsoft.com/en-us/support/legal/sla/storage/v1_5/) (v1.5, June 2019) specifies a 99.9% guarantee for LRS, ZRS and GRS accounts and a 99.99% guarantee for RA-GRS (provided that requests to RA-GRS switch to secondary endpoints if there is no success on the primary endpoint). Go to [Azure Storage redundancy](https://docs.microsoft.com/en-us/azure/storage/common/storage-redundancy) to see which redundancy option is best for a specific scenario."
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Enable Azure Defender for all of your storage accounts",
        "context" : "Azure Defender for Azure Storage provides an additional layer of security intelligence that detects unusual and potentially harmful attempts to access or exploit storage accounts. Security alerts are triggered in Azure Security Center when anomalies in activity occur and are also sent via email to subscription administrators, with details of suspicious activity and recommendations on how to investigate and remediate threats. For more information, see [Configure Azure Defender for Azure Storage](https://docs.microsoft.com/en-us/azure/storage/common/azure-defender-storage-configure)."
    },
    {
        "type": "Design Considerations",
        "pillars": [
            "reliability",
            "operationalexcellence"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "General-purpose v1 storage accounts provide access to all Azure Storage services, but may not have the latest features or the lowest per gigabyte pricing. Microsoft recommends to use general-purpose v2 storage accounts in most cases. Reasons to still use v1 are:\n   * Applications require the classic deployment model.\n   * Applications are transaction-intensive or use significant geo-replication bandwidth, but don't require large capacity.\n   * The use of a Storage Service REST API that is earlier than 2014-02-14 or a client library with a version lower than 4.x is required and an application upgrade is not possible.\n\n    See [Storage account overview](https://docs.microsoft.com/en-us/azure/storage/common/storage-account-overview) for more."
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Turn on soft delete for blob data",
        "context" : "Soft delete enables you to recover blob data after it has been deleted. For more information on soft delete, see [Soft delete for Azure Storage blobs](https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-soft-delete)."
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Use Azure AD to authorize access to blob data",
        "context" : "Azure AD provides superior security and ease of use over Shared Key for authorizing requests to Blob storage. For more information, see Authorize access to [Azure blobs and queues using Azure Active Directory](https://docs.microsoft.com/en-us/azure/storage/common/storage-auth-aad).",
        "children": [
            {
                "title": "Keep in mind the principal of least privilege when assigning permissions to an Azure AD security principal via Azure RBAC",
                "context": "When assigning a role to a user, group, or application, grant that security principal only those permissions that are necessary for them to perform their tasks. Limiting access to resources helps prevent both unintentional and malicious misuse of your data."
            }
        ]
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Store business-critical data in immutable blobs",
        "context" : "Consider using [Blob versioning](https://docs.microsoft.com/en-us/azure/storage/blobs/versioning-overview) to automatically maintain previous versions of an object or the use of legal holds and time-based retention policies to store blob data in a WORM (Write Once, Read Many) state. Blobs stored immutably can be read, but cannot be modified or deleted for the duration of the retention interval. For more information, see [Store business-critical blob data with immutable storage](https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-immutable-storage)."
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Limit shared access signature (SAS) tokens to HTTPS connections only",
        "context" : "Requiring HTTPS when a client uses a SAS token to access blob data helps to minimize the risk of eavesdropping. For more information, see [Grant limited access to Azure Storage resources using shared access signatures (SAS)](https://docs.microsoft.com/en-us/azure/storage/common/storage-sas-overview).",
        "children": [
            {
                "title": "Secure your account access keys with Azure Key Vault",
                "context": "Microsoft recommends using Azure AD to authorize requests to Azure Storage. However, if you must use Shared Key authorization, then secure your account keys with Azure Key Vault. You can retrieve the keys from the key vault at runtime, instead of saving them with your application. "
            },
            {
                "title": "Regenerate your account keys periodically",
                "context": "Rotating the account keys periodically reduces the risk of exposing your data to malicious actors."
            },
            {
                "title": "Have a revocation plan in place for any SAS that you issue to clients",
                "context": "If a SAS is compromised, you will want to revoke that SAS as soon as possible. To revoke a user delegation SAS, revoke the user delegation key to quickly invalidate all signatures associated with that key. To revoke a service SAS that is associated with a stored access policy, you can delete the stored access policy, rename the policy, or change its expiry time to a time that is in the past."
            }
        ]
    },
    {
        "type": "Configuration Recommendations",
        "pillars": [
            "reliability",
            "operationalexcellence",
            "security"
        ],
        "lens": "service",
        "category": "Storage",
        "subCategory": "Storage Accounts",
        "title": "Restrict Default Network Access for Storage Accounts",
        "context" : "Access to storage accounts should be granted to specific Azure Virtual Networks only whenever possible or use [private](https://docs.microsoft.com/en-us/azure/private-link/private-endpoint-overview) endpoints to allow clients on a virtual network (VNet) to securely access data over a [Private Link](https://docs.microsoft.com/en-us/azure/private-link/private-link-overview). See [Use private endpoints for Azure Storage](https://docs.microsoft.com/en-us/azure/storage/common/storage-private-endpoints) for more. Expections are Storage Accounts that need to be accessible via the Internet."
    }
]